In [62]:
import pandas as pd
import numpy as np

In [63]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [64]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [65]:
df['FlightNumber'].fillna(0,inplace = True)

In [66]:
for i in df['FlightNumber'].index:
    if(df['FlightNumber'][i]==0):
        df['FlightNumber'][i]=(df['FlightNumber'][i-1]+df['FlightNumber'][i+1])/2

C:\Users\sunny\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [67]:
df['FlightNumber']

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

In [68]:
df['FlightNumber'].astype(int,inplace = True)

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

In [69]:
df1 = df['From_To'].str.split("_",expand = True)

In [70]:
df1.columns = ['SOURCE','DESTINATION']

In [71]:
df1

     SOURCE DESTINATION
0    LoNDon       paris
1    MAdrid       miLAN
2    londON   StockhOlm
3  Budapest       PaRis
4  Brussels      londOn

In [38]:
df1['SOURCE']

0      LoNDon
1      MAdrid
2      londON
3    Budapest
4    Brussels
Name: SOURCE, dtype: object

In [72]:
 df1['SOURCE']= df1['SOURCE'].str.capitalize()

In [73]:
df1['DESTINATION']= df1['DESTINATION'].str.capitalize()

In [74]:
df1

     SOURCE DESTINATION
0    London       Paris
1    Madrid       Milan
2    London   Stockholm
3  Budapest       Paris
4  Brussels      London

In [75]:
df. drop(columns =['From_To'],inplace = True)

In [76]:
df

   FlightNumber  RecentDelays              Airline
0       10045.0      [23, 47]               KLM(!)
1       10055.0            []    <Air France> (12)
2       10065.0  [24, 43, 87]  (British Airways. )
3       10075.0          [13]       12. Air France
4       10085.0      [67, 32]          "Swiss Air"

In [85]:
df['DESTINATION'] = df1['DESTINATION']

In [86]:
df

   FlightNumber  RecentDelays              Airline    SOURCE DESTINATION
0       10045.0      [23, 47]               KLM(!)    London       Paris
1       10055.0            []    <Air France> (12)    Madrid       Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London   Stockholm
3       10075.0          [13]       12. Air France  Budapest       Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels      London

In [98]:
RecentDelays = df['RecentDelays'].apply(pd.series)

AttributeError: module 'pandas' has no attribute 'series'

In [94]:
type(df['RecentDelays'])

pandas.core.series.Series

In [116]:
RecentDelays = df['RecentDelays'].apply(pd.Series)

In [117]:
RecentDelays

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [118]:
pd.concat([df[:],RecentDelays[:]],axis = 1)

,FlightNumber,RecentDelays,Airline,SOURCE,DESTINATION,0,1,2
0,10045.0,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055.0,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075.0,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [119]:
RecentDelays = RecentDelays.rename(columns = lambda x:'DELAY_'+str(x))

In [120]:
RecentDelays

   DELAY_0  DELAY_1  DELAY_2
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [121]:
pd.concat([df[:],RecentDelays[:]],axis = 1)

,FlightNumber,RecentDelays,Airline,SOURCE,DESTINATION,DELAY_0,DELAY_1,DELAY_2
0,10045.0,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055.0,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075.0,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [124]:
df.drop(columns= ['RecentDelays'],axis = 1)

   FlightNumber              Airline    SOURCE DESTINATION
0       10045.0               KLM(!)    London       Paris
1       10055.0    <Air France> (12)    Madrid       Milan
2       10065.0  (British Airways. )    London   Stockholm
3       10075.0       12. Air France  Budapest       Paris
4       10085.0          "Swiss Air"  Brussels      London

In [127]:
df = pd.concat([df[:],RecentDelays[:]],axis = 1)

In [128]:
df

,FlightNumber,RecentDelays,Airline,SOURCE,DESTINATION,DELAY_0,DELAY_1,DELAY_2
0,10045.0,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055.0,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075.0,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [129]:
df = df.drop(columns= ['RecentDelays'],axis = 1)

In [130]:
df

,FlightNumber,Airline,SOURCE,DESTINATION,DELAY_0,DELAY_1,DELAY_2
0,10045.0,KLM(!),London,Paris,23.0,47.0,NaN
1,10055.0,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075.0,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [133]:
df = df[["SOURCE","DESTINATION","FlightNumber","Airline","DELAY_0","DELAY_1","DELAY_2"]]

In [134]:
df

,SOURCE,DESTINATION,FlightNumber,Airline,DELAY_0,DELAY_1,DELAY_2
0,London,Paris,10045.0,KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055.0,<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065.0,(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075.0,12. Air France,13.0,NaN,NaN
4,Brussels,London,10085.0,"""Swiss Air""",67.0,32.0,NaN